Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.ValidatePHSegmentLengthWarning
The placeholder curve is not long enough to support the required fittings for placeholder convert

Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.ValidatePHSegmentConnWarning
The placeholder curve will not be able to connect to the required fittings for placeholder convert

Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.SizingFailedZeroFlow
Sizing failed. Flow for section is 0.

Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.SegmentIsTooShort
The segment is too short.

Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.MaxWidthAndHeightReached
Maximum width and height reached during sizing

Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.InlineEndoflineMismatch
[Element Name]: It is not possible to calculate the flow since there is inline equipment that is configured as end of line.
Please check equipment in this system and make sure that the equipment connectors used inline have a global system classification and a calculated flow configuration.
Global equipment connectors used inline should always be linked to each other.

Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.FlowDirectionMismatch
[Element Name]: It is not possible to calculate the flow since the flow direction mismatch.
Please check flow direction on all equipment in this system.

Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.FlowConfigMismatch
[Element Name]: It is not possible to calculate the flow since all the components in this system have the flow configuration
set to Preset or System. At least one component is required to have the flow configuration set to Calculated.

Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.FailedToPlaceCapWarning
Failed to place cap on the open connector.

Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.CapsWereAddedWarning
X caps were added.

Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.CapWasAddedWarning
1 cap was added.

Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures
Failures applicable to different mechanical, electrical and piping Elements.